## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| update | `aws_ssm_parameter.gcds_api_config`     |
|        | `module.api.aws_iam_policy.policies[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:307395567143:parameter/gc-design-system-config",
            ]
        }
    }

  # aws_ssm_parameter.gcds_api_config will be updated in-place
  ~ resource "aws_ssm_parameter" "gcds_api_config" {
        id             = "gc-design-system-config"
      + insecure_value = (known after apply)
        name           = "gc-design-system-config"
        tags           = {
            "CostCentre" = "gc-design-system-production"
            "Terraform"  = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 6 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::307395567143:policy/gc-design-system-api-0"
        name      = "gc-design-system-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:307395567143:parameter/gc-design-system-config"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "gc-design-system-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.gc_design_system_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.gc_design_system_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.gc_design_system_warning"]

21 tests, 18 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
